Q1. Create a pandas series that contains the following data: 4,8,15,16,23,and 42.Then print series.

In [5]:
import pandas as pd
a=[4,8,15,16,23,42]
series=pd.Series(a)
print(series)
type(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

pandas.core.series.Series

Q2. Create a variable of list types containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [2]:
import pandas as pd
a=[23452,234525,2345,2345,45674567,3524556557,23452345,3457785,23457567,2635467,236365]
series=pd.Series(a)
print(series)

0          23452
1         234525
2           2345
3           2345
4       45674567
5     3524556557
6       23452345
7        3457785
8       23457567
9        2635467
10        236365
dtype: int64

Q3. Create a pandas DataFrame that contains the following data:
name,Age,gender
alice,25,female
bab,30,male
clarie,27,female

In [22]:
import pandas as pd
data={
    "Name":["Alice","Bab","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}
sheet=pd.DataFrame(data)
print(sheet)
type(sheet)

     Name  Age  Gender
0   Alice   25  Female
1     Bab   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

Q4.What is "Dataframe" in pandas and how is it different from padas series?Explain with an example.

In [8]:
#In pandas, a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled
# axes (rows and columns). It is similar to a spreadsheet or SQL table, and is the most commonly used pandas object.

#On the other hand, a Series is a one-dimensional labeled array capable of holding any data type.
#It is similar to a one-dimensional array or list in Python.

#example series

import pandas as pd 
d=["big","large","small","high"]
series=pd.Series(d)   #here i am using the Series function to call the series pandas
print(series)
type(series)

0      big
1    large
2    small
3     high
dtype: object

pandas.core.series.Series

In [9]:
# so this is the seies types of pandas in pandas and

In [12]:
# example for data frame
import pandas as pd
e=["monday","tuesday","wednesday","thrusday","friday","saturday","sunday"]
days=pd.DataFrame(e,columns=["Day_name"]) #here i am using the DataFrame() function to call the data frame pandas
print(days)
type(days)

    Day_name
0     monday
1    tuesday
2  wednesday
3   thrusday
4     friday
5   saturday
6     sunday

pandas.core.frame.DataFrame

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these fuctions?

In [23]:
# here are some common fuctions which we are using to manipulate the data
import pandas as pd
data={
    "Name":["Alice","Bab","Claire","David","Eve"],
    "Age":[25,30,27,34,24],
    "Gender":["Female","Male","Female","Male","Female"]
}
sheet=pd.DataFrame(data)
print(sheet)
type(sheet)

     Name  Age  Gender
0   Alice   25  Female
1     Bab   30    Male
2  Claire   27  Female
3   David   34    Male
4     Eve   24  Female

pandas.core.frame.DataFrame

In [24]:
#1.head()fuction it used to call the first 5 elements form the table
sheet.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [25]:
#2.tail() this is function is used to call from the last of the table's elements
sheet.tail(1)

  Name  Age  Gender
4  Eve   24  Female

In [26]:
#3. describe():
# Get summary statistics of numerical columns
sheet.describe()

             Age
count   5.000000
mean   28.000000
std     4.062019
min    24.000000
25%    25.000000
50%    27.000000
75%    30.000000
max    34.000000

In [27]:
#4. groupby():
# Split data into groups based on Gender and calculate mean Age for each group
sheet.groupby('Gender').mean()

/tmp/ipykernel_1552/4006608371.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  sheet.groupby('Gender').mean()

              Age
Gender
Female  25.333333
Male    32.000000

In [32]:
#5. drop() it is used the remove the column from the data frame
sheet.drop(["Age"],axis=1)

     Name  Gender
0   Alice  Female
1     Bab    Male
2  Claire  Female
3   David    Male
4     Eve  Female

Q6.Which of the following is mutable in nature Series,DataFrame,Panel?

Solution:DataFrame and Panel are mutable in nature ,mean they can modifed after creation and series is not mutable in nature.

Q7. Create a DataFrame using multiple series.Explain with an example.

In [38]:
import pandas as pd 
a=["vishal","ravi","sanskriti","khushi","mohan"]
b=["male","male","female","female","male"]
c=[23,24,22,22,33]
n=pd.Series(a)
g=pd.Series(b)
l=pd.Series(c)
frame={
    "Namw":n,
    "Gender":g,
    "Age":l
}
data=pd.DataFrame(frame)
score=[23,45,56,67,34]
data["Score"]=pd.Series(score)
data

        Namw  Gender  Age  Score
0     vishal    male   23     23
1       ravi    male   24     45
2  sanskriti  female   22     56
3     khushi  female   22     67
4      mohan    male   33     34